Revit 2024 API
RebarHookType.Create Method
 Creates a new RebarHookType in a document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static RebarHookType Create(
	Document doc,
	double angle,
	double multiplier
)
Visual Basic
Public Shared Function Create ( _
	doc As Document, _
	angle As Double, _
	multiplier As Double _
) As RebarHookType
Visual C++
public:
static RebarHookType^ Create(
	Document^ doc,
	double angle,
	double multiplier
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
angle
Type: System.Double
 Determine the hook angle of new RebarHookType.
multiplier
Type: System.Double
 Determine the straight line multiplier of new RebarHookType.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given value for angle is not a number -or- The given value for multiplier is not a number
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  angle must be greater than 0 and no more than pi. -or- multiplier must be greater than 0 and no more than 99.
See Also
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace